---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MassFailures.FloorAreaFaceFailed
source: html/3111f259-14ef-0ff0-d5b2-98c04498fbe2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MassFailures.FloorAreaFaceFailed Property

Failed to create a Mass Floor.

## Syntax (C#)
```csharp
public static FailureDefinitionId FloorAreaFaceFailed { get; }
```